# -*- coding: utf-8 -*-
# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...

# TODO здесь ваш код
from room_1 import folks

print("в комнате room_1 живет:")
print(', '.join(folks))



