# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."

def buns():
    print("А теперь добавим булочки")

def meatball():
    print("А теперь добавим котлеты")

def cucumbers():
    print("А теперь добавим огурчика")

def tomatoes():
    print("А теперь добавим помидорчика")

def mayonnaise():
    print("А теперь добавим майонеза")

def cheese():
    print("А теперь добавим сыра")